{
	"Description": "Willseeker is a mortal who was possessed by the soul of [Nix] during his birth. His possession granted him a subset of Nix's powers, which he used to make several attempts at overthrowing the royal hierarchies of the [Dreki].",
	"Sections": [
		{
			"Header": "Willseeker",
			"Type": "box",
			"Sections": [
				{
					"Sections": "[image:Willseeker.png]"
				},
				{
					"Header": "Born",
					"Sections": "[TheEnlightenmentAge]"
				},
				{
					"Header": "Died",
					"Sections": "[TheDarknessRebornAge]"
				},
				{
					"Header": "Parents",
					"Sections": "Unknown"
				},
				{
					"Header": "Power Tier",
					"Sections": "Mortal"
				},
				{
					"Header": "Aspect",
					"Sections": "Destruction (Possessed)"
				}
			]
		},
		{
			"Header": "Appearance",
			"Sections": "Willseeker has a predominantly dark purple body with several bright purple burn marks across his legs, tail, and belly. His wings are dotted by tiny white reflective flecks that resemble the night sky when viewed from a distance. When ethereal, the only part of him that is visible are his eyes, which give off a dim purple glow."
		},
		{
			"Header": "Abilities",
			"Sections": "Willseeker gained several abilities from begin possessed by [Nix], the most prominent being his ability to become ethereal when in shadow. This allows him to become effectively invisible and immaterial, as well as to rapidly move between any surface connected by shadow. His etherealness can not be maintained when exposed to bright light or when the shadows he is using are removed. In addition to his etherealness, Willseeker also has access to Nix's overpowering desire to end the existence of all dragons, which can be called forth to give him a sudden burst of pure destructive rage."
		},
		{
			"Header": "Personality",
			"Sections": ""
		},
		{
			"Header": "Childhood",
			"Sections": "Willseeker was born during [TheEnlightenmentAge] to a family of royal guards. They treated him and his five brothers and sisters very poorly, even by the lower standards of the time. The children were often locked away in storage rooms so their parents could go about serving the queen uninterrupted. This habit, although effective, eventually lead to an unfortunate accident when one of the young dragons dislodged a stone holding back a pocket of magma burried in the volcanic walls of the palace. The resulting torrent of lava killed all five of Willseeker's bothers and sisters, and left him permanently scarred and weakened by the loss of large portions of his leg muscles. This tramatic event also caused Nix's formerly dormant soul to awaken, and Willseeker briefly showed signs of turning ethereal while unconscious and being tended to by doctors. The royal high mage, who was attending to unrealted matters at the hospital, took special note of Willseeker's abilities. Being a young dragon, it was expected that Willseeker's parents would eventually come to claim him, but after several days and a short campaign by the doctors to find his parents, nobody came looking for him. The high mage decided to take advantage of this, and claimed him as an adoptive son. All of this occured while Willseeker was still uncouncious, and it was only when he was healed by his new adopted father did he awaken and learn of the events that had occured since the accident. The royal mage had little care for Willseeker's traumatic experience, as he was more concerned with the strange ethereal powers that had manifested because of it. He began doing experiments on Willseeker to test what his abilities could and couldn't do and, because he had a rather sadistic disposition, this often involved torturing Willseeker with various means until he passed out, only to be healed again minutes later so he could resume being experimented with. These near daily experiment sessions and constant imprisonment lasted for the majority of Willseeker's childhood, until the day that he unintentionally called upon Nix's destructive rage, killing the mage and eviscerating his corpse in the process. Willseeker then fled from the palace and into the wilderness, knowing what would happen to him if it was discovered he had killed the royal high mage."
		},
		{
			"Header": "Adulthood",
			"Sections": "Willseeker was killed during [TheDarknessRebornAge]."
		}
	]
}
