{
	"Description": "Willseeker is a mortal dragon who was possessed by the soul of [Nix] during his birth. His possession granted him a subset of Nix's powers, which he used to make several attempts at overthrowing the royal hierarchies of the [Dreki]. His attempts eventually lead to him meeting Myra, who he adopted and raised before his death at the hands of Nix in [TheDarknessRebornAge].",
	"Sections": [
		{
			"Header": "Willseeker",
			"Type": "box",
			"Sections": [
				{
					"Sections": "[image:Willseeker.png]"
				},
				{
					"Header": "Born",
					"Sections": "[TheEnlightenmentAge]"
				},
				{
					"Header": "Died",
					"Sections": "[TheDarknessRebornAge]"
				},
				{
					"Header": "Parents",
					"Sections": "Unknown"
				},
				{
					"Header": "Power Tier",
					"Sections": "Mortal"
				},
				{
					"Header": "Aspect",
					"Sections": "Destruction (Possessed)"
				}
			]
		},
		{
			"Header": "Appearance",
			"Sections": "Willseeker has a predominantly dark purple body with several bright purple burn marks across his legs, tail, and belly. His wings are dotted by tiny white reflective flecks that resemble the night sky when viewed from a distance."
		},
		{
			"Header": "Abilities",
			"Sections": "Willseeker gained several abilities from begin possessed by [Nix], the most prominent being his ability to become ethereal when in shadow. This allows him to become effectively invisible and immaterial, as well as to rapidly move between any surface connected by shadow. His etherealness can not be maintained when exposed to bright light or when the shadows he is using are removed. In addition to his etherealness, Willseeker also has access to Nix's overpowering desire to end the existence of all dragons, which can be called forth to give him a sudden burst of destructive rage."
		},
		{
			"Header": "Personality",
			"Sections": "Before the accident that befell him and his siblings, Willseeker was an intelligent and creative young dragon. He often took to looking through scrolls rather than playing games, even though he had never been taught how to read. Following the accident and years of torture that most of his childhood involved, his emotions would swing wildly between being manipulative and being aggressive. He treated other dragons as below him, even when they were his supposed ally, and felt no moral quandary in killing if he thought it would aid in the downfall of the royalty. Upon meeting [Myra] for the first time, he had a shift in perspective that forced him to rethink his goals of overthrowing the royalty. Raising her slowly healed the mental wounds that had afflicted him for so long, eventually returning him to the dragon he had once been."
		},
		{
			"Header": "Childhood",
			"Sections": "Willseeker was born during [TheEnlightenmentAge] to a family of royal guards. They treated him and his five brothers and sisters with disdain, often locking their children away in storage rooms so they could go about serving the queen uninterrupted. This habit, although effective, eventually lead to an unfortunate accident when one of the young dragons dislodged a stone holding back a pocket of magma buried in the volcanic walls of the palace. The resulting torrent of lava killed all five of Willseeker's siblings and left him permanently scarred by large burn marks across his body. This traumatic event also caused Nix's formerly dormant soul to awaken, and Willseeker briefly showed signs of turning ethereal while unconscious and being tended to by doctors. The royal high mage, who was attending to unrelated matters at the hospital, took special note of Willseeker's abilities. Being a young dragon, it was expected that Willseeker's parents would eventually come to claim him, but after several days and a short campaign by the doctors to find his parents, nobody came looking for him. The high mage decided to take advantage of this and claimed him as an adoptive son. All of this occurred while Willseeker was still unconscious, and it was only when he was healed and awoken by his new adopted father that he learned of the events that had transpired since the accident. The royal mage had little care for Willseeker's traumatic experience as he was more concerned with the strange ethereal powers that had manifested because of it. He began doing experiments on Willseeker to test what his abilities could and could not do and, because he had a rather sadistic disposition, this often involved torturing Willseeker with various means until he passed out, only to be healed again minutes later so he could resume being experimented with. These near daily experiment sessions and constant imprisonment lasted for the majority of Willseeker's childhood, until the day that he unintentionally called upon Nix's destructive rage, killing the mage and eviscerating his corpse in the process. Willseeker then fled from the palace and into the wilderness, knowing what would happen to him if it was discovered he had killed the royal high mage."
		},
		{
			"Header": "Adulthood",
			"Sections": [
				{
					"Header": "The First Attack",
					"Sections": [
						"Having fled the palace, Willseeker suddenly found himself in a very different situation. He was no longer subjected to torment at the hands of the high mage, but he was also no longer being fed food that was already prepared for him. The early days of his freedom were filled with hunger and failed attempts at hunting, which also kept him from thinking about the pot of rage that was boiling inside of him. He initially considered his strange abilities to be an evil thing brought on by the royal mage, but as he was driven to near starvation he was forced to use them again and again to fend for himself. It was not long before he had gotten used to the idea that he was born to be a creature of the darkness, and that the hatred inside of him had been there all along. He decided to turn his hatred towards the royalty, which he saw as the root cause of his problems. After becoming good enough at hunting to feed himself and regain his strength, he attempted to return to his birth queendom and kill the queen himself. He nearly succeeded, being attacked by guards after inflicting near fatal wounds to the queen, but it had not been enough. He was forced to slip away into the shadows and flee the palace for the second time."
					]
				},
				{
					"Header": "The Campaign",
					"Sections": [
						"Word spread rapidly about the attempt on the queen's life by a shadowy demon, and soon all of the palaces across the world were required to brightly light the hallways at all times to keep the demons away. This served as a new roadblock for Willseeker's plans and meant that he could no longer simply slip in and kill the royalty. He traveled to the southern-most queendom, where the rumors of his actions had long since been distorted beyond recognition by word of mouth. He began listening to private conversations from the shadows, targeting notable figures in the royal hierarchy and collecting information that the participants would not want to be made public. He then dropped small notes at their homes, blackmailing them into giving influence over their decisions. He continued doing this with significant dragons across the queendom until he had enough influence to arrange for an audience with the queen.",
						"His original plan had been to kill the queen when he finally met with her, but as he realized how easy it was to manipulate the political powers of the queendom, he formed a new plan that would help him achieve his goals much faster. He told the queen he was one of her spies from the north, coming to warn her of an impending war. The queen did not trust him immediately, however, she did order some of her exterior forces to return to her palace to ensure it was properly fortified. This was exactly what Willseeker desired, using the remainder of his influence over the political underlings to send a seemingly legitimate message to the northern queendom. In it, he declared war against them on behalf of the southern queen. The subsequent mustering of the northern forces confirmed the southern queen's worries, and to Willseeker's satisfaction, also solidified her trust in him. He continued sitting over the queen's shoulder, slowly convincing her to push for more and more territory as the war went on and as a result large parts of the northern queendom's infrastructure were destroyed in the process.",
						"While the war raged on between the two queendoms, Willseeker began the process of collecting influence again in the east, eventually getting into a position where he could convince the queen that she could take advantage of the war. The queen already wished to reclaim the land that had been taken from her previously, and Willseeker provided her with the encouragement she needed to realize her ambitions. With the third queendom entering the war he had created, Willseeker felt his plans were finally properly coming to fruition. He decided to return to the southern queendom to add more fuel to the fire. He arranged to meet with the queen expecting to be able to easily sway her as always, but what he found instead was that she had completely changed. She tore apart any suggestion he made, which confused him greatly since nothing notable had transpired since their last meeting. After a final unsuccessful attempt to convince the queen of anything, he made his way towards the exit only to find it blocked by a wall of fire. He later learned that news had spread about a shadowy dragon whispering in the queen's ear, and when the royal mages heard of it they created a plan to capture what they feared to be one of the demons they had heard about from the other queendoms. Willseeker was able to fight his way out, killing two of the mages in the process, but even as he slipped into the night he was still being pursued by several of them.",
						"He went into hiding, fearing the mages would find him and subject him to the same torture of his youth. In his absence, the war rapidly fell apart. The queens realized the deception that had been at play, and the forces were soon withdrawn with the signing of a new treaty that cemented peace between them once again."
					]
				},
				{
					"Header": "Myra",
					"Sections": [
						"With three of the largest queendoms now unified, it was now even harder than ever for Willseeker to cause trouble for them. Desperate, he formed a plan to murder the royal offspring before they could even hatch, something that long ago he had thought unthinkable. Once his fears that he would be found by mages had subsided, he returned to his home queendom to carry out his plan. He broke into the royal hatchery late at night intending to destroy all of the eggs. He found himself in the rear of the hatchery, where they kept the eggs that were not likely to hatch. There was only one there, so he decided to take the opportunity to start with that one. He put his talons on it and paused, uncertain if he was relishing or hesitating over what he was about to do. In his moment of holding the egg he felt its heartbeat pulse in his talons, realizing it was much slower and weaker than it should have been. It became immediately obvious to him why the egg had been put away in the back where the queen would not see it. It reminded him of his younger self, what he had felt as he slipped into unconsciousness, only this time he was watching from the outside. It would have been effortless for him to crush the egg between his talons, but he could not bring himself to do it. Instead, he just held the egg while the heart inside kept struggling to beat.",
						"As if sensing his own inability, and to his horror, the beats began to get weaker and weaker. In only a few moments they stopped all together, and Willseeker eroded into a sobbing mess, something he had not done since before the accident. He could not accept that the one thing in the world he had chosen to spare had died mere moments later. His hatred flared up again but, in an ironic twist, he hated nothing but himself. He had brought nothing good into the world his whole life, only suffering. In that moment, he was worthless to the universe. His only wish was that he had been able to save the creature in his talons. Maybe then, he would have done one good thing in his life. It was then, sitting there weeping and holding an egg to his chest, that it happened. He felt a shiver pass from him and into the egg, as if he had been struck by a sudden chill. He opened his eyes, confused, and looked down at the egg once again to find that it glowed faintly. A moment later, he felt the heart start to beat, slowly at first but getting stronger with every pulse.",
						"He was immediately filled with overwhelming joy and wonder, but it was short lived. He realized that if he left the egg in the royal hatchery the dragon inside would one day grow up to be the very thing he had sworn to destroy, raised to be a royal and forced to bend to the rules of the bloodline. He knew he could not allow that to happen, but taking the egg with him meant giving up his attempts to overthrow the queens. He returned to living in hiding with his adopted child, having found a new purpose in life. When the egg hatched to reveal a baby female, he chose to name her [Myra] (\"little light\") after the way her egg had glowed on that fateful night. He spent the rest of his years raising her to be a strong dragoness with even stronger morals, finally smothering the soul inside him that only sought to hate. Eventually, the unfortunate day came at the end of [TheDarknessRebornAge] when [Nix] came to collect his soul. Although Myra was distraught by his life being cut short, Willseeker died peacefully knowing that he had given her the chance to live life they way she chose, free of the bloodline that would have forced her to rule."
					]
				}
			]
		}
	]
}
